Autodesk.Revit.DB.WorksetTable.RenameWorkset(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.WorksetId,System.String)
Renames the workset.
aDoc:
The document in which the workset is accessed.
worksetId:
The workset Id.
name:
The workset name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
aDoc is not a workshared document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given workset name is already in use.
-or-
There is no workset in the document with this id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2015 Subscription Update